Public Member Functions | List of all members
ACAPI::ZoneLabelingSettings::Modifier Class Reference
Input Method
Modifier of the ZoneLabelingSettings. More...
#include <ZoneLabelingSettings.hpp>
 Inheritance diagram for ACAPI::ZoneLabelingSettings::Modifier:
 Public Member Functions
void  | SetAutomaticLabeling (bool labeling)
A function to set whether a label should automatically be placed onto new zones or not.
Result< void >  | SetSelectedFavorite (const GS::UniString &favoriteName)
A function to set the label favorite that should be used for the automatic labeling of zones.
Detailed Description
Modifier of the ZoneLabelingSettings.
Member Function Documentation
◆ SetAutomaticLabeling()
 void ACAPI::ZoneLabelingSettings::Modifier::SetAutomaticLabeling  |  ( |  bool |  labeling | )
A function to set whether a label should automatically be placed onto new zones or not.
Parameters
labeling | [in] The logical value to be set, if label should be placed or not.
Example
 ACAPI::ZoneLabelingSettings zoneLabelingSetting = ACAPI::CreateZoneLabelingSettings ();
 ACAPI::Result<void> result = zoneLabelingSetting.Modify ([&] (ACAPI::ZoneLabelingSettings::Modifier& modifier) {
 modifier.SetAutomaticLabeling (!zoneLabelingSetting.IsAutomaticLabelingOn ());
 });
◆ SetSelectedFavorite()
 Result< void > ACAPI::ZoneLabelingSettings::Modifier::SetSelectedFavorite  |  ( |  const GS::UniString & |  favoriteName | )
A function to set the label favorite that should be used for the automatic labeling of zones.
Parameters
favoriteName | [in] The name of the label favorite.
Returns
Returns an error if the favoriteName is incorrect, otherwise nothing.
APIERR_GENERAL - There is no favorite in the list.
APIERR_BADNAME - Favorite for the favorite name does not exist.
APIERR_BADELEMENTTYPE - Favorite is not a label favorite.
Example
 ACAPI::ZoneLabelingSettings zoneLabelingSetting {ACAPI::CreateZoneLabelingSettings ()};
 ACAPI::Result<void> result = zoneLabelingSetting.Modify ([&] (ACAPI::ZoneLabelingSettings::Modifier& modifier) {
 modifier.SetSelectedFavorite (names[0]);
 });
 if (result.IsErr ()) {
 ACAPI_WriteReport (result.UnwrapErr ().text.c_str (), true);
 return;
 }